Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/checks-development.po
Languages: es

source: Checks development
es: Desarrollo de chequeos

source: In this section we will explain how checks should be developed and how Radar runs them. As stated before checks can be programmed in your favourite language.
es: En esta sección explicaremos como se deben desarrollar los chequeos y como Radar los ejecuta. Como ha sido mencionado anteriormente, los chequeos pueden escribirse en tu lenguaje de programación favorito.

source: Introduction
es: Introducción

source: Checks are the way Radar monitors any given resource. Radar only cares how you return the output of your checks, it will expect a valid `JSON <https://en.wikipedia.org/wiki/JSON>`_ containing one or more of the following fields :
es: La forma en que Radar monitorea cualquier recurso es a través de chequeos. Radar solo se preocupa por el string que devuelve un chequeo a la salida estándar. Radar espera que devuelvas un `JSON <https://en.wikipedia.org/wiki/JSON>`_ que contenga uno o más de los siguientes campos :

source: status : This field is mandatory. It must be equal to any of the following string values : OK, WARNING, SEVERE or ERROR.
es: status : Este campo es obligatorio. Debe ser igual a alguno de los siguientes strings : OK, WARNING, SEVERE o ERROR.

source: details : This is an optional field. You can add details about how your check performed. Radar expects this value to be a string.
es: details : Este es un campo opcional. Puedes añadir información detallada acerca de tu chequeo. Radar espera que este campo sea un string.

source: data : This is an optional field. You can put here any data related to your check. Radar does not expect any particular format for this field.
es: data : Este es un campo opcional. Puedes agregar aquí cualquier conjunto de datos relacionado con tu chequeo. Radar no espera que cumplas con un formato particular.

source: So, let's assume you have an uptime check. So the minimum output for this check would be the following JSON :
es: Asumamos que tienes un chequeo que te devuelve la cantidad de tiempo que tu sistema ha estado encendido. La mínima salida que este chequeo debe devolver es el siguiente JSON :

source: Radar is case insensitive when it reads a check's output so it does not care how you name the fields (as long as you include them Radar won't complain), so this JSON is also valid :
es: Radar no hace distinción de mayúsculas o minúsculas al leer la salida estandar de un chequeo, puedes nombrar los campos como desees (siempre y cuando tengan el mismo nombre que los mencionados más arriba). En ese caso este JSON también es válido :

source: Any other combination of upper and lower characters is also valid. Now suppose you want to be more verbose on this check, then you might want to add some details :
es: Cualquier otra combinación de mayúsculas y minúsculas también será válida. Ahora supone que quieres ser un poco más detallado, podrías entonces agregar más información en el campo details :

source: Details will be stored (along with status and data) in their respective checks on the server side, and all your plugins will have visibility on these fields. Now, let's assume that your check also returns data to be processed by any of the plugins on the server side, so your JSON might look something like this :
es: El campo details (en realidad todos los campos utilizados) serán almacenados en el lado del servidor y todos tus plugins que hayas definido tendrán total visibilidad sobre estos campos. Ahora también supongamos que deseas incluir datos para que los mismos sean procesados por algún plugin del lado del servidor :

source: As mentioned before, there is no specific format that you have to comply on the data field, is completely up to you how to lay it out. You can include as much data as you want and in any desired way.
es: Como hemos comentado previamente, no hay un formato específico que debas cumplir sobre el campo data, puedes organizarlo completamente a tu manera. Puedes incluir tantos datos como desees y organizarlos de cualquier forma.

source: Guidelines
es: Consejos

source: Currently Radar checks are executed sequentially, that is one after the other (this is expected to change on a future release), so some care must be taken when developing them. Here are some tips and advices on how to write good checks :
es: Actualmente Radar ejecuta todos sus chequeos de manera secuencial, esto es uno detrás de otro (esto cambiará en algún release futuro), así que debes tener un poco de cuidado al desarrollarlos. Aquí te damos algunos consejos de como escribir chequeos :

source: The order of the checks execution is irrelevant. That means that check Y must not depend on previous execution of check X.
es: El orden de ejecución de los chequeos es irrelevante. Esto significa que un chequeo Y no debe depender de la ejecución anterior de un chequeo X.

source: Checks should check one and only one resource. If you're checking the load average, then just check that and not other things like free memory or disk usage. For those write 2 other checks.
es: Los chequeos deben analizar un y solo un recurso. Si estas verificando la carga promedio de tu sistema, entonces solo verifica ese recurso y no otros como por ejemplo memoria disponible o utilización de disco. Para estos dos últimos escribe otros dos chequeos adicionales.

source: Checks should run as fast as possible or fail quickly. As checks run sequentially if one check lasts 10 seconds to complete, then subsecuent checks will begin executing after 10 seconds.
es: Los chequeos deben ejecutarse lo más rápido posible o fallar rápidamente. Como los chequeos se ejecutan de forma secuencial si un chequeo tarda 10 segundos en completarse, entonces los chequeos subsiguientes comenzarán a ejecutarse luego de 10 segundos.

source: Always fail fast if the resource you're checking is not available for any reason. For example if you're checking the status of your favourite SQL engine and for whatever reason is not running or does not allow you to get its status, then return an ERROR status explaining the reason and don't keep retrying to get its status over and over again.
es: Siempre en caso de error falla rápidamente si el recurso que estas verificando no esta disponible por cualquier razón. Por ejemplo, si estas verificando el estado de tu motor SQL favorito y por alguna razón no se encuentra corriendo o no te permite obtener su estado, entonces devuelve un estado ERROR explicando la razón por la cual ha fallado y no reintentes obtener su estado una y otra vez.

source: Checks should be platform independent. It is nice to just write a check once and then have it running on as many platforms as possible. This promotes reusability.
es: Los chequeos deberían ser independientes de la plataforma. Esta bueno escribir una única vez un chequeo y luego tenerlo disponible en la mayor cantidad de plataformas posible. Esto promueve su reusabilidad.

source: Test your checks ! You're encouraged to write unit tests on all of your checks. This way you make sure that checks behave and fail as expected.
es: ¡Escribe tests sobre tus chequeos! Te recomiendo que escribas tests unitarios en tus chequeos. De esta manera te aseguras de que los mismos se comportan de la manera en que tu esperas que lo hagan.

source: Examples
es: Ejemplos

source: If you're looking for some real examples you can take a look at this `repository <https://github.com/lliendo/Radar-Checks>`_. In there you'll will find some basic but useful checks (written in Python) that allows you to monitor :
es: Si estas buscando algunos ejemplos concretos, puedes echar un vistazo al siguiente `repositorio <https://github.com/lliendo/Radar-Checks>`_. Ahí encontrarás algunos chequeos básicos (escritos en Python) que te permitirán monitorear :

source: Disk usage.
es: Utilización de disco.

source: Ram usage.
es: Utilización de memoria.

source: Uptime.
es: Tiempo de encendido.

source: Process status.
es: Estado de proceso.

source: They have been designed to run on as many platforms as possible. They rely on the excellent `psutil <https://github.com/giampaolo/psutil>`_ module.
es: Fueron diseñados para correr en tantas plataformas como sea posible. Se basan en el excelente módulo `psutil <https://github.com/giampaolo/psutil>`_.

source: Language interpreted checks
es: Chequeos utilizando lenguajes interpretdos

source: If you're on Unix systems and you're planning to use any interpreted programming language for check development keep in mind NOT to use the env program as `shebang <https://en.wikipedia.org/wiki/Shebang_%28Unix%29>`_, for example if you were going develop a `Ruby <https://en.wikipedia.org/wiki/Ruby_%28programming_language%29>`_ script, don't use :
es: Si te encuentras en un sistema Unix y estas planeado utilizar algún lenguaje de programación interpretado ten en cuenta de NO utilizar el programa env como `shebang <https://en.wikipedia.org/wiki/Shebang_%28Unix%29>`_, por ejemplo si fueras a desarrollar un script en `Ruby <https://en.wikipedia.org/wiki/Ruby_%28programming_language%29>`_, no utilices :

source: If you do so, when Radar spawns the script it will end up as a defunct process. This is because the env program is fired initially (which in turn should call the Ruby interpreter). Always use a shebang that points directly to the interpreter that you want to use :
es: Si lo haces, cuando Radar lance el script el mismo terminará como un proceso defunct. Esto se debe a que el programa env es invocado (que a su vez debería invocar al intérprete de Ruby). Siempre utiliza un shebang que apunte directamente al intérprete que deseas utilizar :

source: On Unix systems the exact path to the interpreter that you want to use can be retrieved using the 'whereis' command. For example to get the full path to the Ruby interpreter you would issue :
es: En los sistemas Unix el path exácto al intérprete que quieres utilizar lo puedes obtener utilizando el comando 'whereis'. Por ejemplo, para obtener el path absoluto al intérprete de Ruby puedes ejecutar :

source: The above explained only applies to Unix environments. Also remember to turn on the execution bits if using a shebang.
es: Todo lo explicado anteriormente solo es válido en sistemas Unix. También recuerda habilitar los bits de ejecución si utilizas un script con shebang.
