Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/client-configuration.po
Languages: es

source: Client configuration
es: Configuración del cliente

source: If you understood how a Radar server is configured then configuring a Radar client is even easier (mainly because you don't define elements such as contacts, checks, monitors and plugins).
es: Si has entendido como configurar el servidor Radar entonces la configuración del cliente es todavía más fácil (principalmente porque no defines elementos como contactos, chequeos, monitores y plugins).

source: Main configuration
es: Configuración principal

source: The main configuration governs general aspects of the Radar client. We'll take a look at a full configuration file and describe every available option (this time we will setup a Windows Radar client) :
es: La configuración principal gobierna los aspectos generales del cliente Radar. Veremos a continuación una configuración completa y describiremos cada opción disponible (esta vez configuraremos un cliente Windows) :

source: connect : This option tells Radar client where to connect to. At the moment only IPv4 addresses are supported. By default it tries to connect to localhost port 3333.
es: connect : Esta opción le indica al cliente la dirección y puerto del servidor Radar al cual debe conectarse. Por defecto se intentará conectar a localhost puerto 3333.

source: run as : On Unix platforms this option tells Radar the effective user and group that the process should run as. This is a basic security consideration to allow Radar to run with an unprivileged user. The specified user should not be a able to login to the system. The default user and group is radar. This option does not apply to Windows platforms.
es: run as : En plataformas Unix esta opción permite indicarle a Radar el usuario y grupo efectivo con el cual debe correr. Esta es una consideración básica de seguridad para permitir a Radar ejecutarse con un usuario sin privilegios. Este usuario no debería poder ingresar al sistema. Por defecto tanto el usuario como el grupo utilizados es 'radar'. Esta opción no esta actualmente disponible en plataformas Windows.

source: log : Radar will log all of its activity in this file. So if you feel that something is not working properly this is the place to look for any errors. Note that in the example there are two additional options : size and rotations. They indicate the maximum size (in MiB) that a log should grow, when its size goes beyond that amount then is rotated (backed up) and new logs are written to a new file. By default Radar sets a maximum of 100 MiB for the log file and rotates it at most 5 times.
es: log : Radar registrará toda su actividad en este archivo de log. Si presumes que algo no esta funcionando adecuadamente este archivo es el lugar a examinar. Ten en cuenta que el ejemplo muestra dos opciones adicionales : size y rotations. Estas indican el tamaño máximo que el archivo de log (en MiB) tiene permitido crecer. Cuando dicho tamaño es superado el archivo es rotado (se realiza un back up) y las entradas de log son escritas a un nuevo archivo. Por defecto Radar define un máximo de 100 MiB para el tamaño del archivo de log y lo rota a lo sumo 5 veces.

source: pid file : On Unix platforms this file holds the PID of the Radar process. When Radar starts it will record its pidfile here and when it shuts down this file is deleted. Pid files are not recorded on Windows platforms.
es: pid file : En plataformas Unix este archivo contiene el PID del proceso Radar. Este archivo se genera cuando Radar es arrancado y al finalizar su ejecución es eliminado. Este archivo no es generado en plataformas Windows.

source: checks : This is the location where all your checks are stored. Every time a Radar client receives a CHECK message from the server all checks are first looked up here if a relative path was given, otherwise it will be looked up by its absolute path. You can lay out this directory as you wish.
es: checks : Este es el directorio en donde se encuentran almacenados los chequeos que el cliente tiene permitido ejecutar. Cada vez que el cliente recibe un mensaje de tipo CHECK en primer lugar el o los chequeos son buscados en este directorio si la ruta especificada es relativa, caso contrario se lo intentará localizar por su ruta absoluta. Puedes organizar este directorio como gustes.

source: enforce ownership : On Unix platforms if this option is True then every time the Radar client has to execute a check it will first verify that the user and group of any check matches the one defined in the run as option. If the user and group does not match and error is generated and the check won't run. On Windows platforms it will only check for the user. By default this option is set to True.
es: enforce ownership : En las plataformas Unix si esta opción esta con un valor True entonces cada vez que el cliente necesite ejecutar un chequeo primero verificará que el usuario y grupo del chequeo coincida con el que se ha definido en la opcion 'run as'. Si el usuario y grupo no coinciden se genera un error y el chequeo no es ejecutado. En plataformas Windows solo se verificará el usuario. Por defecto esta opción tiene el valor True.

source: reconnect : This option specifies the behaviour of the client when a Radar server goes down. If set to True and if the Radar server stops working the client will keep retrying to connect to the server. By default this option is set to True.
es: reconnect : Esta opción especifica el comportamiento del cliente cuando se pierde la conexión con el servidor. Si dicha opcion tiene un valor True y el servidor se desconecta, el cliente intentará reconectarse al servidor. Por defecto esta opción tiene un valor True.

source: As usual you can leave out almost every option to its default value. A minimum Radar client configuration file might look like this :
es: Como siempre, es posible dejar opciones sin configurar. Dichas opciones tomarán sus valores por defecto. A continuación podrás ver un archivo de configuración mínimo :

source: All remaining options take default values. Check these defaults on the platform defaults section.
es: Todas las opciones restantes toman sus valores por defecto. Verifica estos valores en la sección 'valores por defecto' de la documentación.
