Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: es

source: Installation
es: Instalación

source: At the moment Radar is only available from its source code from `Github <https://github.com/lliendo/Radar>`_. As the project evolves it will be eventually added to `PyPI <https://pypi.python.org/pypi>`_.
es: Por el momento Radar esta solamente disponible desde su código fuente en `Github <https://github.com/lliendo/Radar>`_. Eventualmente el proyecto evolucionará y será incorporado a `PyPI <https://pypi.python.org/pypi>`_.

source: PyPI packages will be delivered when the project is assured to be stable. Current Radar's status is ALPHA.
es: El proyecto se distribuirá a PyPI una vez que entre en un estado estable. Actualmente Radar se encuentra en estado ALFA.

source: To install Radar from Github (you will need `GIT <https://git-scm.com/>`_ installed on your system) open a terminal or command prompt and run :
es: Para instalar Radar desde Github (necesitarás tener instalado `GIT <https://git-scm.com/>`_ en tu sistema) abre una consola y ejecuta :

source: Alternatively you can download Radar as a `.zip <https://github.com/lliendo/Radar/archive/master.zip>`_ file, extract it and then run :
es: Alternativamente puedes descargar todo el proyecto en un `.zip <https://github.com/lliendo/Radar/archive/master.zip>`_, descomprimirlo y luego ejecutar :

source: from the project's root directory.
es: desde el directorio principal del proyecto.

source: Checking the installation
es: Verificando la instalación

source: You can check that Radar was successfully installed by running from the command line :
es: Para verificar si Radar se ha instalado correctamente puedes ejecutar los siguientes comandos desde la consola :

source: This will display the current version of Radar (client and server) installed on your system. If you see these versions then you got both client and server successfully installed, otherwise something went wrong.
es: Esto mostrará la versión actual de Radar (cliente y servidor) instalada en tu sistema. Si logras ver estas versiones entonces Radar ha sido instalado exitosamente.

source: By default Radar expects to find configuration files in well-defined places. These directories are platform dependent (you can check these defaults from the platform defaults section of this document).
es: Por defecto Radar espera encontrar archivos de configuración en lugares predeterminados. Estos directorios son dependientes de la plataforma en donde Radar se encuentra instalado (puedes verificar estos directorios en la sección 'valores por defecto' de este documento).

source: It is a good practice to use these default directories. Of course if you don't want to use those locations you can change them from the main configuration file.
es: Es una buena práctica utilizar estos directorios predeterminados. Por supuesto si no quieres hacer uso de estas ubicaciones puedes cambiarlas desde el archivo de configuración principal.

source: Radar only takes its main configuration file to be able to run. If you want to override the default main configuration file path you can invoke Radar this way :
es: Radar únicamente utiliza un archivo de configuración principal para comenzar su ejecución. Si quieres indicar un archivo de configuración principal alternativo, puedes invocar a Radar de la siguiente manera :

source: The -c option specifies an alternate main configuration file.
es: La opcion -c permite especificar un archivo de configuración principal diferente.

source: Adding restricted account
es: Agregando una cuenta restringida

source: As a basic security measure it is recommended to create a restricted account to be used by Radar. By default Radar assumes that the name of this account is 'radar' (but you can use whatever account you want).
es: Como medida básica de seguridad te recomiendo crear una cuenta restrigida para Radar. Por defecto Radar asume que el nombre de dicha cuenta es 'radar' (pero puedes utilizar la cuenta que desees).

source: Unix OS
es: Sistemas Unix

source: For any of the following systems :
es: Para cualquiera de las siguientes plataformas :

source: Open a new console.
es: Abre una consola.

source: Switch to the root user using the `su <https://en.wikipedia.org/wiki/Su_%28Unix%29>`_ command.
es: Cambia al usuario root utilizando el comando `su <https://en.wikipedia.org/wiki/Su_%28Unix%29>`_.

source: GNU/Linux systems typically have the 'useradd' commands to create a new user :
es: Los sistemas GNU/Linux por lo general poseen el comando 'useradd' para crear u nuevo usuario.

source: On FreeBSD systems, run :
es: En sistemas FreeBSD, ejecuta :

source: On OpenBSD systems, run :
es: En sistemas OpenBSD, corre :

source: As a last step, verify that you are not allowed to login with the 'radar' user.
es: Verifica que no puedes ingresar al sistema con el usuario 'radar'.

source: Windows platforms
es: Plataformas Windows

source: On Windows platforms little more work is needed. The following steps apply for Windows 7 Professional or better :
es: En plataformas Windows hay que realizar varios pasos. Estas instrucciones son válidas para Windows 7 Profesional o versiones posteriores :

source: Add a new user named 'radar' from Control Panel -> User Accounts.
es: Agrega un nuevo usuario 'radar' desde Panel de control -> Cuentas de usuario.

source: Open GPEDIT.MSC (a.k.a. Local Group Policy Editor).
es: Abre GPEDIT (Editor de directivas de grupo local).

source: From the left side pane navigate through :
es: Navega el arbol del panel izquierdo :

source: On the right side pane locate the 'Deny log on locally' policy.
es: En el panel derecho encuentra la política 'Denegar el inicio de sesión local'.

source: Right clic on 'Deny log on locally' and clic on Properties.
es: Haz clic derecho sobre 'Denegar el inicio de sesión local' y luego haz clic sobre Propiedades.

source: Clic the 'Add User or Group' button to add the radar user account.
es: Haz clic sobre el botón 'Agregar Usuario o Grupo'.

source: On the text box type in : radar. Now clic the 'Check Names' button and then clic on 'OK'.
es: En el text box tipea : radar. Ahora haz clic el boton 'Verificar nombres' y luego en 'Aceptar'.

source: Repeat steps 5 and 6 but for the 'Deny log on through Remote Desktop Services' policy.
es: Repite los pasos 5 y 6 pero para la política 'Denegar inicio de sesión a traves de Servicio de Escritorio remoto'.

source: Log out and verify that you are not allowed to login with the 'radar' user (locally and remotely).
es: Verifica que no puedes ingresar al sistema con la cuenta 'radar' (tanto localmente como remotamente).

source: Setting up Radar
es: Configurando Radar

source: Before you start configuring Radar I recommend you to read the documentation as some options may not make full sense. If you've already read the docs then go ahead and start configuring Radar.
es: Antes de comenzar la configuración de Radar te recomiendo leer toda la documentación ya que podrías no entender cada una de las opciones disponibles presentadas por el script de configuración. Si ya has leido la documentación entonces continua con los siguientes pasos.

source: Radar comes with two useful scripts to help you configure it the first time.
es: Radar viene con dos scripts para ayudarte a configurarlo la primera vez.

source: To configure the server just run :
es: Para configurar el servidor ejecuta :

source: This script will ask you for some initial values. For every option you can leave its default (these values are shown in squared brackets) value by pressing Enter.
es: Este script te preguntará por algunos valores iniciales. Por cada opción puedes utilizar su valor por defecto (estos valores se encuentran entre corchetes) presionando Enter.

source: To configure the client run :
es: Para configurar el cliente ejecuta :

source: After you run those scripts the main configuration file gets generated in the path that you chose. Note that the resulting YAML file may not look as tidy as the ones presented in the rest of documentation. This is because the PyYAML library does not care about new lines and does not handle element ordering. Something similar happens on the order in which the options are scanned from the console. You can run these scripts as many times as you want but be aware that if you point to the same output files they'll be completely overwritten.
es: Luego de que hayas ejecutado estos scripts la configuración principal queda almacenada en el archivo que hayas elegido. Ten en cuenta que el archivo YAML generado no se ve tan ordenado como el que se muestra en la documantación. Esto se debe a que la biblioteca PyYAML no se encarga de agregar saltos de línea entre diferentes elementos y tampoco permite definir el orden de los elementos.

source: Configuring startup scripts
es: Configurando scripts de inicio

source: Depending on which OS you're using here are instructions to make Radar (server or client) automatically start at system boot.
es: Dependiendo que sistema operativo utilices aquí estan las instrucciones para configurar el inicio automático de Radar en el arraque (tanto cliente como servidor).

source: For GNU/Linux (SysV) :
es: En sistemas GNU/Linux (SysV)

source: Copy the radar-server init script :
es: Copia el script de inicio radar-server :

source: Replace DISTRIBUTION by the flavour of GNU/Linux that you're using.
es: Reemplaza DISTRIBUTION por la distribución GNU/Linux que utilices.

source: Make sure that the owner/group of the file is root :
es: Asegurate de que el dueño del archivo es el usuario root :

source: Make sure the file permissions are :
es: Verifica los permisos del archivo :

source: Make symlinks :
es: Crea los symlinks :

source: The above command adds automatic startup for runlevel 2 (repeat the last step for different runlevels as you need).
es: El comando anterior agrega el arranque automático de Radar para el runlevel 2 (repite este último paso para los runlevels que creas convenientes).

source: Before starting the service :
es: Antes de iniciar el servicio :

source: Open the /etc/init.d/radar-server file.
es: Abre el archivo /etc/init.d/radar-server.

source: Verify that the DAEMON_ARGS variable points to the same main configuration file that you setup with the radar-server-config.py configuration script or change that path as you need.
es: Verifica que la variable DAEMON_ARGS apunta al mismo archivo de configuración principal que has definido al ejecutar el script de configuración radar-server-config.py o modifica dicha variable según lo necesites.

source: Start the service :
es: Inicia el servicio :

source: To add the Radar client on system startup follow the same steps but replace 'radar-server' by 'radar-client'.
es: Para agregar el cliente de Radar al inicio del sistema sigue los mismos pasos anteriores pero reemplaza 'radar-server' por 'radar-client'.

source: For GNU/Linux (Systemd) :
es: En sistemas GNU/Linux (Systemd)

source: Copy the radar-server.service and radar-server files :
es: Copia los archivos radar-server.service y radar-server :

source: Enable the unit :
es: Habilita el unit :

source: Open the /etc/default/radar-server file.
es: Abre el archivo /etc/default/radar-server.

source: Verify that the RADAR_SERVER_OPTS variable points to the same main configuration file that you setup with the radar-server-config.py configuration script or change that path as you need.
es: Verifica que la variable RADAR_SERVER_OPTS apunta al mismo archivo de configuración principal que has definido al ejecutar el script de configuración radar-server-config.py o modifica dicha variable según lo necesites.
