Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/internals.po
Languages: es

source: The CheckManager maintains two queues to allow controlled concurrency execution of checks, these queues are the _wait_queue and the _execution_queue. As described before all checks go initially to the _wait_queue. This queue can indeed grow without any restrictions. The execution queue however only allows a maximun of N checks at any given time (N is actually the number specified by the 'check concurrency' option). Everytime a check or checks arrive they are put on the _wait_queue and if there is enough room available in the _execution_queue they are moved there and then those checks are launched. As our CheckManager is non-blocking we have the advantage to periodically check the status of our spawn checks, and that's exactly what we do to prenvent indefinite execution. Every time the CheckManager iterates it also verifies that no check has taken more than certain amount of time to execute. If this is indeed the case then those checks are forced to terminate and marked as TIMEOUT.
es: El CheckManager administra dos colas que posibilitan la ejecución de chequeos de forma concurrente y controlada, estas colas son _wait_queue y _execution_queue. Como se ha mencionado anteriormente todos los chequeos van inicialmente a la _wait_queue. Esta cola de hecho puede crecer sin ningún tipo de restricción. La cola _execution_queue en cambio solo admite un numero N máximo de chequeos en cualquier instante (N es en realidad el número especificado por la opción 'check concurrency'). Cada vez que uno o varios chequeos llegan se los envía a la cola _wait_queue y si existe espacio suficiente en la cola _execution_queue se los mueven allí y luego son ejecutados. Como nuestro CheckManager es no bloqueante tenemos la ventaja de poder verificar periodicamente el estado de los chequeos que hemos lanzado y esto es exactamente lo que hacemos para prevenir la ejecución indefinida de los mismos. Cada vez que el CheckManager itera también se encarga de verificar que ningún chequeo ha tomado más de un cierto tiempo en ejecutarse. Si este es el caso entonces dichos chequeos son terminados de manera forzosa y se los marca con el estado TIMEOUT.

source: Every check's output is collected and verified (the CheckManager makes sure that the Check didn't blow up and that a valid status was returned). It also discards all fields that are not relevant (it will only keep the status, details and data fields of the returned JSON).
es: Cada una de las salidas de los chequeos es recolectada y verificada (el CheckManager se asegura que un chequeo no ha reventado y que un estado válido ha sido devuelto). Adicionalmente descartará todos aquellos campos que no son relevantes (solo se quedará con los campos status, details y data del JSON devuelto por el chequeo).
