Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/overview.po
Languages: es

source: Overview
es: Introducción

source: Radar is a monitoring tool that tries to make things simple and easy. Radar is not an advanced monitoring tool and you may not find all features that you may find in other monitoring solutions because Radar's philosophy is based heavily on two ideas :
es: Radar es una herramienta de monitoreo que intenta ser simple y fácil de usar. Radar no es una aplicación de monitoreo avanzada y puede que no encuentres todas aquellas características que podrías encontrar en otras soluciones ya que la filosofía de Radar se apoya en estas dos ideas :

source: Simplicity : Both user-interface and source code are intended to be as simple and clean as possible. The code isn't designed to grow indefinitely mainly because by limiting its scope, its behaviour can be better controlled, tested and understood. The code is designed to be understood by anyone who has some Python and OOP knowledge. Its main ideas are described later in the internals section of this document.
es: Simplicidad : Tanto la interfaz de usuario como el código fuente tienen la intención de ser tan simples y prolijos como sea posible. El código no esta pensado para que crezca indefinidamente, principalmente porque limitando su alcance, su comportamiento puede ser mejor comprendido, probado y entendido. El código esta diseñado para que cualquier persona que tenga conocimientos de Python y programación orientada a objetos lo pueda entender sin dificultades. Las ideas principales del código fuente son descriptas más adelante en este documento.

source: Extensibility : As you will see later Radar is not focused on any particular resource monitoring. Instead it allows you to integrate any custom designed checks to verify any resource that you want. This does not only applies to IT infrastructure, you could for example read data from a sensor that is attached to a PC or device that is capable of running the Python interpreter.
es: Extendibilidad : Como verás más adelante Radar no apunta al monitoreo de ningún recurso en particular. En vez de ello, Radar te permite integrar cualquier chequeo que hayas diseñado y controlar cualquier recurso que te interese. Esto no solo aplica a infraestrutura IT, podrías por ejemplo leer datos de un sensor que este conectado a una PC o dispositivo que pueda ejecutar el intérprete de Python.

source: Once you get the Radar server up and running any number of clients may connect and after a user-defined interval they will be constantly polled. The following diagram shows the big picture how Radar operates :
es: Una vez que el servidor de Radar se encuentra en ejecución cualquier número de clientes pueden conectarse y luego de un intervalo de tiempo los mismos serán consultados constantemente. El siguiente diagrama muestra por arriba como opera Radar.

source: So what can you really do with Radar ? Here are some ideas :
es: ¿Que puedes hacer realmente con Radar? Aquí te damos algunas ideas :

source: Notifications : This is a typical use. Notify any of your defined contacts if something is not performing as expected. You can notify by email, sms or maybe put data in a queue and have another process take that responsibility. You could also notify through a real time messaging system like `XMPP <https://en.wikipedia.org/wiki/XMPP>`_.
es: Notificaciones : Este es un uso típico. Puedes notificar a cualquiera de tus contactos si algo no esta funcionando como corresponde. Puedes notificar por email, sms o simplemente pasar estos datos a una cola y que otro proceso tome esa responsabilidad. Podrías también notificar mediante algún sistema de mensajería de tiempo real como por ejemplo `XMPP <https://en.wikipedia.org/wiki/XMPP>`_.

source: Graphing tool : Each time you receive data from a check you can add that information to a database (like `RRDtool <http://www.rrdtool.org>`_) and then generate graphs. You can get trends of your resources this way.
es: Herramienta graficadora : Cada vez que recibes información de un chequeo, puedes agregar dicha información a una base de datos (por ejemplo `RRDtool <http://www.rrdtool.org>`_) y luego generar gráficas. De esta manera puedes obtener tendencias del uso de tus recursos.

source: Take an advanced action : Suppose that you run a cluster of servers on a cloud-based provider. Then by inspecting the replies of your checks, you can write a plugin to add/remove servers on demand, if you get for example that the amount of requests/sec. that a server is processing are exceeded.
es: Tomar una acción avanzada : Suponte que tienes un conjunto de servidores de algún proveedor en la nube. Luego al inspeccionar las respuestas de tus chequeos podrías escribir un plugin para agregar/eliminar servidores a demanda, si percibes que por ejemplo la cantidad de peticiones/seg. que un servidor esta procesado han sido excedidas.

source: Any of these ideas requires that you write a plugin for it, Radar does not include any built-in functionality and these tasks are delegated to plugins. You can take a look how to develop checks and plugins on the following sections of this document. Don't panic ! A lot of effort has been put to make these tasks as simple as possible, so keep reading the docs.
es: Cualquiera de estas ideas requiere que tu escribas un plugin. Radar no incluye ningún tipo de funcionalidad para hacer alguna de las tareas mencionadas anteriormente. Puedes echar un vistazo al desarrollo de plugins en las secciones posteriores de este documento. ¡A no asustarse! Se ha puesto considerable esfuerzo para que esta tarea sea lo más sencilla posible, así que continua leyendo la documentación.
