Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/platform-defaults.po
Languages: es

source: Platform defaults
es: Valores por defecto

source: Unix OS's
es: Sistemas Unix

source: Unix OS's have these default values :
es: Los sistemas Unix poseen estos valores por defecto :

source: Radar server (/etc/radar/server/main.yml) :
es: Servidor (/etc/radar/server/main.yml) :

source: Radar client (/etc/radar/client/main.yml) :
es: Cliente (/etc/radar/client/main.yml) :

source: Windows platforms
es: Plataformas Windows

source: Windows platforms have the following default values :
es: Las plataformas Windows poseen los siguientes valores por defecto :

source: Radar server (C:\\Program Files\\Radar\\Server\\Config\\main.yml) :
es: Servidor (C:\\Program Files\\Radar\\Server\\Config\\main.yml) :

source: Radar client (C:\\Program Files\\Radar\\Client\\Config\\main.yml) :
es: Cliente (C:\\Program Files\\Radar\\Client\\Config\\main.yml) :

source: Radar supports all platforms where the Python interpreter is able to run. However, Radar internally makes a distinction between Unix like OS's and Microsoft Windows platforms.
es: Radar soporta todas aquellas plataformas donde es posible ejecutar el int√©rprete de Python. Sin embargo, Radar internamente distingue entre sistemas Unix y plataformas Microsoft Windows.
