Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/server-configuration.po
Languages: es

source: Radar server relies on plugins to perform certain actions. For example assume that you want to notify your contacts by SMS and you also want to be able to store all your checks data to a relational databse. So it might be perfectly reasonable to ask yourself how to do that with Radar.
es: Radar se apoya en plugins para realizar ciertas acciones. Por ejemplo, si deseas notificar a tus contactos mediante SMS o si deseas insertar los resultados de ciertos chequeos en una base de datos relacional los plugins ofrecen un mecanismo para lograr esto.

source: Radar does not provide any built-in mechanisms to do these kind of things because that responsability is left to plugins. For the moment we're not going to describe how to write a plugin but how to install them.
es: Radar no provee ninguna funcionalidad interna para realizar este tipo de cosas porque no es su responsabilidad. Por el momento no describiremos como desarrollar un plugin pero si como instalarlos.

source: As described previously there is one plugin directory defined in the main configuration file. This directory holds all the plugins managed by Radar. How is the layout of this directory ? If you've read previous sections you noticed that you have full freedom to layout monitors, checks and contacts directories. This is not the case for the plugins directory.
es: Como ha sido descripto anteriormente existe un directorio de plugins que ha sido definido en la configuración principal de Radar. Este directorio contiene todos los plugins que utiliza Radar. ¿Como es la estructura de dicho directorio?. Como hemos comentado en las secciones previas los directorios de chequeos, contactos y monitores poseen total libertad en cuanto a su organización jerárquica se refiere. Este no es el caso del directorio de plugins.

source: Let's assume that your plugins directory is : /tmp/Radar/server/plugins. Then you have a bunch of plugins you want install. Simply copy all of them to that directory.
es: Por el momento asumamos que nuestro directorio de plugins es : /tmp/Radar/server/plugins y que también tenemos varios plugins que deseamos instalar. Para instalarlos simplemente debemos copiarlos a dicho directorio.

source: The layout of the plugins directory might look something like this :
es: La organización de directorio de plugins se asemejaría a :

source: Every plugin must be contained within one directory below the defined plugins directory. Some plugins might contain configurations as well (from the above example 'another-plugin' seems to have its own YAML configuration file). Check each plugin's documentation to figure out the scope of a plugin and how can you adjust it to fit your needs.
es: Cada plugin debe estar contenido en su propio directorio y debe encontrarse en el directorio de plugins definido en el archivo de configuracion principal. Algunos plugins también podrían llegar a tener configuraciones adicionales. Del ejemplo anterior podemos ver que 'another-plugin' posee su propio archivo de configuracion YAML. Verifica la documentación de cada plugin para entender su alcance y como configurarlo para que se ajuste a tu medida.
