Repository: lliendo/Radar
Catalog: docs/locale/*/LC_MESSAGES/server-configuration.po
Languages: es

source: Server configuration
es: Configuración del servidor

source: Radar is simple and flexible in the way it defines different kind of components (checks, contacts and monitors). It uses `YAML <https://en.wikipedia.org/wiki/YAML>`_ for all of its configuration.
es: Radar es simple y flexible en la manera en que permite al usuario definir diferentes tipos de componentes (chequeos, contactos y monitores). Utiliza archivos `YAML <https://en.wikipedia.org/wiki/YAML>`_ para describir toda su configuración.

source: When Radar starts it expects a main configuration file (this applies to both client and server) as input. From that configuration file, further locations are read to find checks, contacts, monitors definitions and plugins.
es: Cuando Radar es iniciado espera un archivo de configuración principal (esto aplica tanto al cliente como al servidor) como punto de entrada. A partir de este archivo de configuración otras ubicaciones son leidas para encontrar definiciones de chequeos, contactos, monitores y plugins.

source: You're going to read a long document where the most important concepts of Radar are described. Take a cup of your favourite beverage and read it carefully. Once you read it you will find that configuring Radar is easy. Try not to skip any sections because every part of it has something to say. By the end of this document you'll have solid knowledge on how to configure Radar and not going into trouble on the way.
es: Comenzarás ahora a leer un documento relativamente extenso donde los conceptos más importantes de Radar serán detallados. Léelo con detenimiento. Para cuando hayas finalizado su lectura podrás darte cuenta que configurar Radar es una tarea fácil. Intenta no saltear secciones ya que cada parte tiene algo que detallar. Hacia el final del documento deberías tener el conocimiento necesario para configurar Radar sin inconvenientes.

source: Main configuration
es: Configuración principal

source: The main configuration governs general aspects of the Radar server. We'll take a look at a full configuration file and describe every available option :
es: El archivo de configuración principal gobierna aspectos generales del funcionamiento de Radar. Le daremos un vistazo a dicho archivo y describiremos cada una de sus opciones :

source: listen : The listen options specifies the address and port number where Radar server is going to listen for new clients. At the moment only IPv4 addresses are supported. The default values are to listen on localhost and port 3333.
es: listen : Esta opción permite especificar la dirección y puerto en que Radar escuchará a la espera de nuevos clientes. Por el momento solo direcciones IPv4 son soportadas. Por defecto Radar escuchará en localhost en el puerto 3333.

source: run as : On Unix platforms this option tells Radar the effective user and group that the process should run as. This is a basic security consideration to allow Radar to run with an unprivileged user. The specified user should not be a able to login to the system. The default user and group is radar. This option does not apply to Windows platforms.
es: pid file : En plataformas Unix este archivo contiene el PID del proceso Radar. Este archivo se genera cuando Radar es arrancado y al finalizar su ejecución es eliminado. Este archivo no es generado en plataformas Windows.

source: polling time : This tells Radar the frequency of the execution of checks. It is expressed in seconds. By default Radar will poll all its clients every 300 seconds (that is five minutes). You're not allowed to specify values under one second. Fractions of a second are allowed so you can poll your clients let's say every 10.5 seconds.
es: polling time : Indica la frecuencia con la que se ejecutarán los chequeos en los clientes. Se expresa este tiempo en segundos. Por defecto Radar consultará a todos sus clientes conectados cada 300 segundos (es decir, cinco minutos). No esta permitido especificar valores debajo de un segundo. Las fracciones de segundo estan permitidas asi que es posible consultar clientes por ejemplo cada 10.5 segundos.

source: log : Radar will log all of its activity in this file. So if you feel that something is not working properly this is the place to look for any errors. Note that in the example there are two additional options : size and rotations. They indicate the maximum size (in MiB) that a log should grow, when its size goes beyond that amount then is rotated (backed up) and new logs are written to a new file. By default Radar sets a maximum of 100 MiB for the log file and rotates it at most 5 times.
es: log : Radar registrará toda su actividad en este archivo de log. Si presumes que algo no esta funcionando adecuadamente este archivo es el lugar a examinar. Ten en cuenta que el ejemplo muestra dos opciones adicionales : size y rotations. Estas indican el tamaño máximo que el archivo de log (en MiB) tiene permitido crecer. Cuando dicho tamaño es superado el archivo es rotado (se realiza un back up) y las entradas de log son escritas a un nuevo archivo. Por defecto Radar define un máximo de 100 MiB para el tamaño del archivo de log y lo rota a lo sumo 5 veces.

source: pid file : On Unix platforms this file holds the PID of the Radar process. When Radar starts it will record its pidfile here and when it shuts down this file is deleted. Pid files are not recorded on Windows platforms.
es: run as : En plataformas Unix esta opción permite indicarle a Radar el usuario y grupo efectivo con el cual debe correr. Esta es una consideración básica de seguridad para permitir a Radar ejecutarse con un usuario sin privilegios. Este usuario no debería poder ingresar al sistema. Por defecto tanto el usuario como el grupo utilizado es radar. Esta opción no esta actualmente disponible en plataformas Windows.

source: checks, contacts, monitors, plugins : All these set of options tell Radar where to look for checks, contacts, monitors and plugins. They're just directory names. Radar does not impose on you any layout on these directories. This means that you are free to put configurations on any file on any directory below the ones you defined. The only requirement is that you are not allowed to mix for example contacts or contact groups with other components such as checks or check groups. Every directory is designed to contain specific elements. These set of directories are platform dependant.
es: checks, contacts, monitors, plugins : Todas estas cuatro opciones indican a Radar directorios donde buscar : chequeos, contactos, monitores y plugins. Radar no impone ninguna restricción acerca de la disposición jerárquica en dichos directorios. Esto significa que tienes total libertad de colocar archivos de configuración en cualquier archivo bajo cualquier directorio que hayas definido. El único requerimiento que debes satisfacer es que no esta permitido mezclar por ejemplo contactos o grupos de contactos con otros componentes como chequeos o grupos de chequeos. Cada directorio esta diseñado para contener elementos específicos. Este conjunto de directorios son dependientes de la plataforma donde Radar se encuentra corriendo.

source: Let's now take a look at a minimum configuration. Every platform has a default configuration and the options that are different from one another are the ones that are platform dependant.
es: Miremos ahora un ejemplo de un archivo de configuración principal mínimo. Cada plataforma posee una configuración por defecto y las únicas opciones que son diferentes entre una y otra son aquellas que dependen de la plataforma.

source: As you can see from the example most of the options are not defined. They are not really missing, if you don't specify an option it will take its default value. This means that you only need to worry about the options you want to modify. The above example will poll clients every minute and listen on 192.168.0.100:3333.
es: Como puedes ver en el ejemplo, la mayoría de las opciones no han sido definidas. No es que esten faltando sino que si no especificas una opción entonces la misma toma su valor por defecto. Esto significa que solo debes preocuparte por aquellas opciones que deseas modificar. El ejemplo arriba expuesto, consultará a todos sus clientes cada un minuto y se encuentra escuchando en 192.168.0.100 puerto 3333.

source: Checks configuration
es: Configuración de chequeos

source: As commented above all checks and check groups definitions are expected to be found in the checks defined directory.
es: Como ha sido detallado previamente, todas las definiciones de chequeos y grupos de chequeos esperan ser encontrados en el directorio que se definió en la opcion checks.

source: How checks are defined ? Each check is defined as follows :
es: ¿Como se definen los chequeos?. Cada chequeo es especificado de la siguiente forma :

source: Let's review each parameter of a check definition :
es: Revisemos cada parámetro de esta configuración :

source: name : Each check must be uniquely identified. This is the purpose of the name parameter, it acts as a unique identifier. You can use whatever name you like. This parameter is mandatory.
es: name : Cada chequeo debe ser identificado de manera únivoca. Este es el propósito de este parámetro, es decir actua como un identificador único. Puedes utilizar cualquier nombre que desees. Este parámetro es obligatorio.

source: path : The full filesystem path to the check. If this path is not absolute then the check is looked up in the client's defined check directory. This parameter is mandatory.
es: path : Indica la ruta absoluta del chequeo. Si esta ruta no es absoluta entonces el chequeo es buscado en el directorio de chequeos que tiene definido el cliente. Este parámetro es obligatorio.

source: args : This parameter is used to specify any additional arguments that you need to pass to the check. This parameter is optional.
es: args : Este parámetro es utilizado para suministrar al chequeo opciones adcionales de la línea comandos. Este parámetro es opcional.

source: Let's now move on defining check groups. Check groups can be defined in two different ways, let's see the first one :
es: Continuemos ahora con la definición de grupos de chequeos. Los mismos pueden ser definidos de dos maneras distintas, comencemos con la primera :

source: You define a check group by giving that group a name and a set of checks that make up that group. This allows you to reference a check group later on when you define monitors. Check groups are useful because you define only once a group and then use it in any number of monitors.
es: Defines un grupo dándole a dicho grupo un nombre y un conjunto de chequeos que constituyen el grupo. Esto te permite (más adelante) referenciar un grupo de chequeos al definir monitores. Los grupos de chequeos son útiles ya que te permiten definir sólo una vez un grupo y luego utilizarlo en cualquier número de monitores.

source: Let's now take a look at a second way of defining a check group :
es: Veamos ahora una segunda manera de definir un grupo de chequeo :

source: In this example we've defined a check first and referenced it later from a check group. This is perfectly valid and is actually a very convenient way to define check groups. Why ? Let's suppose that you have two or more check groups that are very similar but some of them perform additionally other checks, then by defining checks individually and referencing them allows you to define checks once and use them in as many groups as you want making the overall configuration shorter and easier to understand. Note that the check definition could also had been defined after the check group because Radar does not care about definition order. Being that said the above configuration is equal to :
es: En este ejemplo hemos definido en primer lugar un chequeo y luego lo hemos referenciado desde un grupo de chequeos. Esto es perfectamente válido y es una forma muy conveniente de definir grupos de chequeos. ¿Porqué? Supongamos que tienes dos o más grupos de chequeos que son similares pero algunos de ellos tienen ciertos chequeos adicionales. Al definir los chequeos individualmente y luego referenciarlos, esto te permite definir los chequeos una única vez y utilizarlos tantas veces sea necesario en cuantos grupos de chequeos desees. Esto hace que tu configuración sea más compacta y fácil de entender. Ten en cuenta que es posible primero definir un grupo de chequeo y luego los chequeos como muestra el siguiente ejemplo :

source: Here's a fragment of how a real configuration might look like :
es: Aquí tienes un fragmento de una configuración real a modo de ejemplo :

source: Some final notes on defining checks (this actually applies to the overall configuration) :
es: Algunas consideraciones generales al definir chequeos (estas consideraciones en realidad se aplican a toda la configuración en general) :

source: Radar expects at least one check or check group to exist in the overall configuration. Otherwise, why use Radar if you don't want to check at least one resource ?
es: Radar espera al menos un chequeo o un grupo de chequeos que exista en toda su configuración. Sino, ¿Para que utilizar Radar si no deseas verificar al menos un recurso?.

source: Checks and check groups are allowed to be repeated and Radar won't complain at all. However there are no guarantees at all which of the repeated check or check groups Radar will keep. The rule is that you must not duplicate check or check groups names.
es: Tanto los chequeos como los grupos de chequeos pueden repetirse y Radar no se quejará al respecto. Sin embargo no hay ninguna garantía de cual de los todos chequeos o grupos de chequeos repetidos se utilizará. La regla es que no debes repetir chequeos o grupos de chequeos.

source: As stated before the order of definition does not matter because Radar will first build all of its checks and then proceed to build all the check groups. The same applies for contacts and contact groups.
es: Como ha sido aclarado previamente, el órden en que son definidos los chequeos o grupos de chequeos no influye de modo alguno ya que Radar primero construirá todos los chequeos y luego los grupos de chequeos. Esto mismo se aplica también para los contactos y grupos de contactos.

source: If you have a relatively big configuration then it might be useful to split it among different files and in some cases among directories. Remember that Radar does not impose you any restrictions on this.
es: Si tienes una configuración relativamente extensa entonces puede ser beneficioso fragmentarla en diferentes archivos y en algunos casos en diferentes directorios. Recuerda que Radar no te impone ninguna condición en el esquema de directorios.

source: Contacts configuration
es: Configuración de contactos

source: If you understood how checks and checks groups are defined then defining contacts and contact groups is exactly the same !
es: Si has comprendido como se definen los chequeos y los grupos de chequeos entonces, ¡la configuración de contactos y grupos de contactos es exactamente análoga!

source: Here's an example of a contact definition :
es: Veamos un ejemplo :

source: name : Each contact must be uniquely identified. This is the purpose of the name parameter, it acts as a unique identifier. You can use whatever name you like. This parameter is mandatory.
es: name : Cada contacto debe ser unívocamente identificado. Este es el propósito de este parámetro. Puedes utilizar cualquier nombre que desees. Este parámetro es obligatorio.

source: email : The email of the contact you're defining. Radar won't check at all if the defined email address is valid, so be careful ! This parameter is mandatory.
es: email : Este es el correo electrónico del contacto que estas definiendo. Radar no comprobará si dicha dirección es válida, asi que ten cuidado al definirla. Este parámetro es obligatorio.

source: phone : This is the phone number of the contact. Radar won't check if this is a valid phone number. This parameter is optional.
es: phone : Este es el número de teléfono del contacto. Nuevamente Radar no verificará si dicho numero telefónico es válido. Este parámetro es opcional.

source: Let's see a contact group definition :
es: Pasemos ahora a ver la definición de un grupo de contactos :

source: Compare the above definitions (against checks and check groups). You'll realize that they are almost identical, of course the identifiers for each component are different but the same idea remains : you can compose contact groups as you like and reference contacts from any contact group.
es: Compára las definiciones previas y las de los chequeos y grupos de chequeos. Seguramente te habrás dado cuenta que son practicamente idénticas, claro que los identificadores de cada componente son diferentes pero la misma idea prevalece : puedes componer grupos de contactos como desees y referenciar contactos desde cualquier grupo de contactos.

source: There is one little difference between checks and contacts definitions. In some scenarios it might not be needed to notify any contact at all, so Radar allows you to leave contacts empty, in other words defining contacts and contact groups is completely optional.
es: Existe una pequeña diferencia entre la definición de chequeos y contactos que no hemos mencionado. En algunos escenarios podría no ser necesario definir contactos (por ejemplo aquellos casos donde los resultados sean almacenados en una base de datos o enviados a una cola). En otras palabras, la definición tanto de contactos como grupos de contactos es completamente opcional.

source: Monitors configuration
es: Configuración de monitores

source: Once you have defined all your contacts and checks the last step is to define monitors. Monitors are the way to tell Radar which hosts to watch, what to check and who notify.
es: Una vez que has logrado definir contactos y chequeos (o solamente chequeos) el último paso es definir monitores. Los monitores son instrucciones que permiten indicarle a Radar que hosts monitorear, que chequear y a quién notificar.

source: Let's walk through a real example :
es: Veamos el siguiente ejemplo :

source: The above example is telling Radar to monitor localhost and all hosts that are in the 192.168.0.101 - 192.168.0.200 range and to check for Basic health, Disk usage and to notify Sysadmins. So to define monitors you basically have :
es: El ejemplo arriba expuesto le indica a Radar que monitoree a localhost y a todos los hosts que se encuentran en el rango de direcciones ip 192.168.0.101 y 192.168.0.200, que verifique (es decir que chequee) Basic health y Disk usage y que notifique a Sysadmins. Entonces para definir monitores básicamente tienes :

source: name: Monitors are allowed to have a name. As you can see from the second last example its setting is completly optional.
es: name: Los monitores pueden tener un nombre. Como puedes ver en el anteúltimo ejemplo la especificación de un nombre es totalmente opcional.

source: hosts : There are three different way to specify hosts. You can specify a single host by its IPv4 (this if the preferred way) or by its hostname. The last way to define hosts is using an IPv4 range. This is useful for example if you want to run the same checks on a set of hosts. Ranges are specified by its start, a hyphen and its end ip. The initial and ending hosts are included in the range.
es: hosts : Hay tres maneras diferentes de especificar hosts. Puedes especificar un único host mediante su IPv4 (esta es la forma preferida) o mediante su hostname. La última manera de definir hosts es mediante un rango IPv4. Esto es útil por ejemplo si deseas ejecutar los mismos chequeos en un conjunto de hosts. Los rangos IPv4 se especifican mediante una dirección inicial, un guión y una dirección final. Los extremos de dicho rango estan incluidos. Debes referenciar al menos un host.

source: watch : This is a list of checks or check groups to be run on the monitored hosts. You only need to reference previously defined checks or check group names.
es: watch : Esta es una lista de chequeos o grupos de chequeos a ser ejecutados en los hosts monitoreados. Solamente debes referenciar el nombre de un chequeo o grupo de chequeo. Debes al menos referenciar un chequeo o grupo de chequeos.

source: notify : Same as above but for contacts. You need to reference a list of previously defined contacts or contact groups.
es: notify : Exactamente lo mismo sucede con los contactos. Debes referenciar una lista de contactos o grupos de contactos definidos previamente. Recuerda que es opcional definir contactos y grupos de contactos por lo cual esta definición es también opcional.

source: Note that the hosts, watch and notify parameters are defined within squared brackets. Don't forget this when defining monitors ! This is the only place where we use a list (more precisely a YAML list) of elements.
es: Ten en cuenta que los hosts, chequeos a verificar y contactos a notificar han sido definidos entre corchetes []. ¡No olvides esto al definir monitores!. Este es el único lugar donde utilizamos una lista YAML.

source: You can include as many monitors as you want on each file. There are no restrictions. You need to be careful when you reference checks and contacts in the monitors definition because Radar will not validate the referenced checks and contacts. This means that if you reference a contact, contact group, check or check group that does not exist Radar won't complain. All references in monitors are case sensitive so you also need to be aware about this, the best practice to avoid this kind of issue is to stick to a rule (e.g. always lower case references, camel case, etc).
es: Puedes incluir tantos monitores como desees en cada archivo, no hay restricciones. Debes tener cuidado al referenciar chequeos o contactos en la definición de monitores ya que Radar no validará si estos existen. Esto significa que si haces referencia a un contacto, grupo de contacto, chequeo o grupo de chequeo y no existe, Radar no se quejará al respecto. Ten también en cuenta que todas las definiciones son sensibles a mayúsculas, minúsculas y espacios. La mejor forma de evitar un problema relacionado a esto es utilizar siempre la misma regla al realizar definiciones, por ejemplo puedes definir siempre todo en minúsculas, usar camel case, etc.

source: You may be wondering under which conditions Radar knows if it should notify its contacts. The Radar core does not handle (and does not care) this, but plugins might do. Every time a Radar client replies the server this information is passed to all defined server plugins. If you have a notification plugin installed (e.g. an email notification plugin) it will probably inspect the current and previous status of a check to decide if it should notify the affected contacts.
es: Debes estar preguntándote bajo que condiciones Radar determina si debe notificar a sus contactos. El núcleo de Radar no maneja (de hecho ni siquiera le importa) esto, pero algunos plugins puede que lo hagan. Cada vez que un cliente Radar responde al servidor esta información es transferida a todos los plugins definidos en el servidor. Si tienes por ejemplo un plugin que notifica a tus contactos mediante correo electrónico, entonces es muy probable que dicho plugin inspeccione el estado actual y anterior de un chequeo para determinar si debe notificar a un grupo de contactos.

source: Don't worry if you don't want to write a Radar plugin (you don't have to, although you're encouraged to at least understand how a plugin works and how it should be designed).
es: No te preocupes si no quieres escribir un plugin de Radar (no necesitas hacerlo, aunque te recomiendo a que al menos comprendas como un plugin funciona y como debe ser diseñado).

source: Plugins configuration
es: Configuración de plugins
